# Subqueries
- Single Row Subqueries - Child query returns single value
- Multi Row Subqueries - Child query returns multiple values

### All Employees
Display all employees from the EMP table.

In [ ]:
SELECT * FROM emp;

### Employees Ordered by Salary (Descending)
Show employees sorted by salary in descending order.

In [ ]:
SELECT * FROM emp ORDER BY sal DESC;

### Highest Salary
Find the maximum salary among all employees.

In [ ]:
SELECT MAX(sal) FROM emp;

### Second Highest Salary
Find the second highest salary by excluding the maximum in a subquery.

In [ ]:
SELECT MAX(sal) FROM emp WHERE sal < (SELECT MAX(sal) FROM emp);

### Employees Ordered by Salary (Ascending)
Show employees sorted by salary in ascending order.

In [ ]:
SELECT * FROM emp ORDER BY sal ASC;

### Lowest Salary
Find the minimum salary among all employees.

In [ ]:
SELECT MIN(sal) FROM emp;

### Second Lowest Salary
Find the second lowest salary by excluding the minimum in a subquery.

In [ ]:
SELECT MIN(sal) FROM emp WHERE sal > (SELECT MIN(sal) FROM emp);

### Employees with Maximum Salary
Display employees whose salary equals the maximum salary.

In [ ]:
SELECT MAX(sal) FROM emp;

In [ ]:
SELECT * FROM emp WHERE sal = 5000;

In [ ]:
SELECT * FROM emp WHERE sal = (SELECT MAX(sal) FROM emp);

### Maximum Salary by Department
Find the maximum salary in each department.

In [ ]:
SELECT deptno, MAX(sal) FROM emp GROUP BY deptno;

Trying to select ename with GROUP BY raises an error.

In [ ]:
SELECT ename, deptno, MAX(sal) FROM emp GROUP BY deptno;

A subquery returning multiple rows causes an error.

In [ ]:
SELECT deptno, ename, sal FROM emp WHERE sal = (SELECT MAX(sal) FROM emp GROUP BY deptno);

### Maximum Salary by Department (Correct)
Find employees who earn the maximum salary in each department.

In [ ]:
SELECT deptno, ename, sal FROM emp WHERE sal IN (SELECT MAX(sal) FROM emp GROUP BY deptno);

Find employees whose salary is greater than at least one salary in department 20.

In [ ]:
SELECT ename, sal FROM emp WHERE sal > ANY (SELECT sal FROM emp WHERE deptno = 20);

Find employees whose salary is greater than all salaries in department 20.

In [ ]:
SELECT ename, sal FROM emp WHERE sal > ALL (SELECT sal FROM emp WHERE deptno = 20);

Find employees who work in either Sales or Research department.

In [ ]:
SELECT ename, deptno FROM emp WHERE deptno IN (SELECT deptno FROM dept WHERE dname IN ('SALES', 'RESEARCH'));